lighter/httperf/test1.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.07 --send-buffer=4096 --recv-buffer=16384 --wsesslog=500,0.000,input.txt
Maximum connect burst length: 2

Total: connections 500 requests 8506 replies 8316 test-duration 36.643 s

Connection rate: 13.6 conn/s (73.3 ms/conn, <=478 concurrent connections)
Connection time [ms]: min 1528.4 avg 13132.7 max 32973.2 median 8569.5 stddev 10328.6
Connection time [ms]: connect 62.8
Connection length [replies/conn]: 319.846

Request rate: 232.1 req/s (4.3 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 62.0 avg 225.1 max 308.4 stddev 94.4 (7 samples)
Reply time [ms]: response 54.1 transfer 0.0
Reply size [B]: header 217.0 content 2132.0 footer 0.0 (total 2349.0)
Reply status: 1xx=0 2xx=8316 3xx=0 4xx=0 5xx=0

CPU time [s]: user 29.77 system 6.88 (user 81.2% system 18.8% total 100.0%)
Net I/O: 545.1 KB/s (4.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 8316 
Session rate [sess/s]: min 0.00 avg 0.71 max 1.40 stddev 0.43 (26/26)
Session: avg 1.00 connections/session
Session lifetime [s]: 13.1
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 2 0 2