lighter/httperf/test4.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.07 --send-buffer=4096 --recv-buffer=16384 --wsesslog=500,0.000,input.txt
Maximum connect burst length: 2

Total: connections 500 requests 8511 replies 8330 test-duration 36.626 s

Connection rate: 13.7 conn/s (73.3 ms/conn, <=478 concurrent connections)
Connection time [ms]: min 1546.5 avg 13157.6 max 33091.2 median 8570.5 stddev 10374.7
Connection time [ms]: connect 50.0
Connection length [replies/conn]: 320.385

Request rate: 232.4 req/s (4.3 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 62.2 avg 225.5 max 309.2 stddev 94.7 (7 samples)
Reply time [ms]: response 54.2 transfer 0.0
Reply size [B]: header 217.0 content 2132.0 footer 0.0 (total 2349.0)
Reply status: 1xx=0 2xx=8330 3xx=0 4xx=0 5xx=0

CPU time [s]: user 29.90 system 6.73 (user 81.6% system 18.4% total 100.0%)
Net I/O: 546.2 KB/s (4.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 8330 
Session rate [sess/s]: min 0.00 avg 0.71 max 1.40 stddev 0.43 (26/26)
Session: avg 1.00 connections/session
Session lifetime [s]: 13.2
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 2 0 2